We first want to import pandas, numpy, and the appropriate libraries to run SQL in Jupyter Notebook

In [1]:
import pandas as pd
import numpy as np
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330
import psycopg2
import sqlalchemy

pd.set_option('display.max_colwidth', None)
pd.set_option('display.max_columns', None)
country_data = pd.read_csv("cleaned_data.csv").drop("Unnamed: 0", axis=1)
# convert year back to int to avoid SQL errors
country_data['year'] = pd.DatetimeIndex(country_data['year']).year

engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330', paramstyle="format")
%sql drop table if exists co2_data
country_data.to_sql('co2_data', engine)

 * postgres://jovyan:***@localhost:5432/si330
Done.

In [2]:
display(country_data.dtypes)

country                                 object
country code                            object
Region                                  object
Income                                  object
2018 GDP                               float64
year                                     int64
co2 (M Tonnes)                         float64
co2_growth_prct                        float64
co2_growth_abs (M Tonnes)              float64
consumption_co2 (M Tonnes)             float64
trade_co2 (M Tonnes)                   float64
trade_co2_share                        float64
co2_per_capita (Tonnes)                float64
consumption_co2_per_capita (Tonnes)    float64
share_global_co2                       float64
cumulative_co2 (M Tonnes)              float64
share_global_cumulative_co2            float64
population                             float64
co2 per 2018 GDP (M Tonnes/USD)        float64
dtype: object

Now we want to make some basic queries into our data, which can be done using SQL

From what regions of the world do these 202 countries from?

In [3]:
%%sql 
select row_number () over (order by count(distinct "country") desc) as "rank", 
"Region", count(distinct "country") as "Number of Countries" from 
co2_data group by "Region" order by "Number of Countries" desc;

 * postgres://jovyan:***@localhost:5432/si330
7 rows affected.

[(1, 'Europe & Central Asia', 52),
 (2, 'Sub-Saharan Africa', 48),
 (3, 'Latin America & Caribbean', 38),
 (4, 'East Asia & Pacific', 32),
 (5, 'Middle East & North Africa', 21),
 (6, 'South Asia', 8),
 (7, 'North America', 3)]

What regions of the world produced the most co2 emissions in 2019?

In [4]:
%%sql 
select row_number () over (order by round(sum("co2 (M Tonnes)")) desc) as "rank",
"Region", round(sum("co2 (M Tonnes)")) as "2019 co2 Emissions" from co2_data 
where "co2 (M Tonnes)" is not null and year=2019 group by "Region" order by "2019 co2 Emissions" desc;

 * postgres://jovyan:***@localhost:5432/si330
7 rows affected.

[(1, 'East Asia & Pacific', 14177.0),
 (2, 'Europe & Central Asia', 6429.0),
 (3, 'North America', 5862.0),
 (4, 'South Asia', 3020.0),
 (5, 'Middle East & North Africa', 2825.0),
 (6, 'Latin America & Caribbean', 1698.0),
 (7, 'Sub-Saharan Africa', 868.0)]

Which countries emitted the most co2 in 2019 and how much did they emit?

In [5]:
%%sql 
select row_number () over (order by round("co2 (M Tonnes)") desc) as "rank",
"country", round("co2 (M Tonnes)") as "2019 co2 Emissions", "Income" from co2_data 
where "co2 (M Tonnes)" is not null and year=2019 order by "2019 co2 Emissions" desc limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(1, 'China', 10175.0, 'Upper middle'),
 (2, 'United States', 5285.0, 'High'),
 (3, 'India', 2616.0, 'Lower middle'),
 (4, 'Russian Federation', 1678.0, 'Upper middle'),
 (5, 'Japan', 1107.0, 'High'),
 (6, 'Iran, Islamic Rep.', 780.0, 'Upper middle'),
 (7, 'Germany', 702.0, 'High'),
 (8, 'Indonesia', 618.0, 'Upper middle'),
 (9, 'Korea, Rep.', 611.0, 'High'),
 (10, 'Saudi Arabia', 582.0, 'High')]

How much co2 emissions did countries emit by their income level?

In [6]:
%%sql 
select row_number () over (order by sum("co2 (M Tonnes)") desc) as "rank",
"Income", sum("co2 (M Tonnes)") as "Summed 2019 co2 Emissions" from co2_data 
where "co2 (M Tonnes)" is not null and year=2019 group by "Income" order by "Summed 2019 co2 Emissions" desc;

 * postgres://jovyan:***@localhost:5432/si330
4 rows affected.

[(1, 'Upper middle', 17179.562),
 (2, 'High', 12768.658),
 (3, 'Lower middle', 4746.05),
 (4, 'Low', 185.715)]

In [7]:
%%sql 
select row_number () over (order by sum("cumulative_co2 (M Tonnes)") desc) as "rank",
"Income", sum("cumulative_co2 (M Tonnes)") as "Cumulative co2 Emissions" from co2_data 
where "cumulative_co2 (M Tonnes)" is not null group by "Income" order by "Cumulative co2 Emissions" desc;

 * postgres://jovyan:***@localhost:5432/si330
4 rows affected.

[(1, 'High', 43635028.8249999),
 (2, 'Upper middle', 12474762.166),
 (3, 'Lower middle', 3218205.233),
 (4, 'Low', 291964.368)]

In [8]:
%%sql 
select row_number () over (order by "cumulative_co2 (M Tonnes)" desc) as "rank",
"country","year","cumulative_co2 (M Tonnes)", "Income"  from co2_data 
where "cumulative_co2 (M Tonnes)" is not null and year = 2019 order by "cumulative_co2 (M Tonnes)" desc limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(1, 'United States', 2019, 410238.263, 'High'),
 (2, 'China', 2019, 219985.862, 'Upper middle'),
 (3, 'Russian Federation', 2019, 113884.448, 'Upper middle'),
 (4, 'Germany', 2019, 91979.322, 'High'),
 (5, 'United Kingdom', 2019, 77835.7, 'High'),
 (6, 'Japan', 2019, 64584.916, 'High'),
 (7, 'India', 2019, 51937.016, 'Lower middle'),
 (8, 'France', 2019, 38258.339, 'High'),
 (9, 'Canada', 2019, 33113.538, 'High'),
 (10, 'Ukraine', 2019, 29549.363, 'Lower middle')]

In [9]:
%%sql 
select row_number () over (order by "cumulative_co2 (M Tonnes)"/"population" desc) as "rank",
"country", ("cumulative_co2 (M Tonnes)"/"population") as "cumulative co2_emissions_per_capita (M Tonnes) 2019", "Income" from co2_data
where "cumulative_co2 (M Tonnes)" is not null and year=2019 order by "cumulative co2_emissions_per_capita (M Tonnes) 2019" desc limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(1, 'Sint Maarten (Dutch part)', 0.00158257142857143, 'High'),
 (2, 'United States', 0.00124667853759418, 'High'),
 (3, 'Luxembourg', 0.00121113149350649, 'High'),
 (4, 'United Kingdom', 0.00115260921072116, 'High'),
 (5, 'Estonia', 0.00113971417797888, 'High'),
 (6, 'Czech Republic', 0.0011118818411451, 'High'),
 (7, 'Germany', 0.00110132454470347, 'High'),
 (8, 'Trinidad and Tobago', 0.0010957541218638, 'High'),
 (9, 'Belgium', 0.00107978031025219, 'High'),
 (10, 'Canada', 0.000885128384699687, 'High')]

In [10]:
%%sql 
select row_number () over (order by "co2_per_capita (Tonnes)" desc) as "rank",
"country", "co2_per_capita (Tonnes)", "Income" from co2_data
where "co2_per_capita (Tonnes)" is not null and year=2019 order by "co2_per_capita (Tonnes)" desc limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(1, 'Qatar', 38.61, 'High'),
 (2, 'New Caledonia', 29.864, 'High'),
 (3, 'Trinidad and Tobago', 27.143, 'High'),
 (4, 'Kuwait', 25.56, 'High'),
 (5, 'Brunei Darussalam', 20.99, 'High'),
 (6, 'Bahrain', 20.935, 'High'),
 (7, 'Mongolia', 20.314, 'Lower middle'),
 (8, 'United Arab Emirates', 19.515, 'High'),
 (9, 'Sint Maarten (Dutch part)', 17.934, 'High'),
 (10, 'Saudi Arabia', 16.988, 'High')]

In [11]:
%%sql 
select row_number () over (order by "co2_per_capita (Tonnes)" desc) as "rank",
"country", "co2_per_capita (Tonnes)", "Income" from co2_data
where "co2_per_capita (Tonnes)" is not null and year=2019 and population > 4000000 
order by "co2_per_capita (Tonnes)" desc limit 10;

 * postgres://jovyan:***@localhost:5432/si330
10 rows affected.

[(1, 'Kuwait', 25.56, 'High'),
 (2, 'United Arab Emirates', 19.515, 'High'),
 (3, 'Saudi Arabia', 16.988, 'High'),
 (4, 'Kazakhstan', 16.915, 'Upper middle'),
 (5, 'Australia', 16.308, 'High'),
 (6, 'United States', 16.06, 'High'),
 (7, 'Canada', 15.414, 'High'),
 (8, 'Turkmenistan', 14.414, 'Upper middle'),
 (9, 'Oman', 14.409, 'High'),
 (10, 'Korea, Rep.', 11.933, 'High')]